# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 0-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2

  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 4
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 5-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 6-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 7-P5

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                       # 9
  - [-1, 1, Conv, [256, 1]]                        # 10

  - [-1, 1, CARAFE, [256,3,2]] # 11
  - [-1, 1, EMA, [256]]        # 12
  - [[-1, 6], 1, multiply, []] # 13
  - [[-1, 11], 1, Add, []]     # 14

  - [11, 1,CARAFE, [128,3,2]]  # 15
  - [-1, 1, EMA, [128]]        # 16
  - [[-1, 5], 1, multiply, []] # 17
  - [[-1, 15], 1, Add, []]     # 18

  - [15, 1,CARAFE, [64,3,2]]   # 19
  - [-1, 1, EMA, [64]]         # 20
  - [[-1, 4], 1, multiply, []] # 21
  - [[-1, 19], 1, Add, []]     # 22

  - [[22, 18, 14], 1, ASFF3, [64, 0]]   # 23
  - [[22, 18, 14], 1, ASFF3, [128, 1]]  # 24
  - [[22, 18, 14], 1, ASFF3, [256, 2]]  # 25

  - [-3, 1, RepC3_MSBlock, [128, 0.5]]      # 26
  - [-3, 1, RepC3_MSBlock, [256, 0.5]]      # 27
  - [-3, 1, RepC3_MSBlock, [512, 0.5]]      # 28

  - [[26, 27, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)