# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 0-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2


  - [-1, 3, Blocks, [64,  BottleNeck, 2, False]] # 4
  - [-1, 4, Blocks, [128, BottleNeck, 3, False]] # 5-P3
  - [-1, 23, Blocks, [256, BottleNeck, 4, False]] # 6-P4
  - [-1, 3, Blocks, [512, BottleNeck, 5, False]] # 7-P5

head:
  - [-1, 1, Conv, [384, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [2048, 8]] # 9
  - [-1, 1, Conv, [384, 1, 1]]  # 10, Y5, lateral_convs.0

  - [4, 1, Conv, [96, 3, 2]]   # 11 downsample backbone P3
  - [6, 1, Dy_Sample, []]  # 12
  - [[11, 5, 12], 1, Concat, [1]] # 13
  - [-1, 1, Conv, [96, 1,1]]   # 14

  - [5, 1, Conv, [192, 3, 2]]   # 15 downsample backbone P3
  - [10, 1, Dy_Sample, []]  # 16
  - [[15, 6, 16], 1, Concat, [1]] # 17
  - [-1, 1, Conv, [192, 1,1]]   # 18

  - [[14, 18], 1, ASFF2, [96, 0]]      # 19
  - [[14, 18], 1, ASFF2, [192, 1]]     # 20
  - [-2, 1, RepC3, [96]]          # 21
  - [-2, 1, RepC3, [192]]         # 22

  - [[21, 22, 10], 1, ASFF3, [96, 0]]  # 23
  - [[21, 22, 10], 1, ASFF3, [192, 1]] # 24
  - [[21, 22, 10], 1, ASFF3, [384, 2]] # 25

  - [23, 1, RepC3, [96]]         # 26
  - [-1, 1, Conv, [192, 1, 1]]      # 27
  - [24, 1, RepC3, [384]]         # 28
  - [-1, 1, Conv, [192, 1, 1]]      # 29
  - [25, 1, RepC3, [768]]         # 30
  - [-1, 1, Conv, [192, 1, 1]]      # 31

  - [[27, 29, 31], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 6]]  # Detect(P3, P4, P5)