# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']] # 0-P1
  - [-1, 1, ConvNormLayer, [32, 3, 1, 1, 'relu']] # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, 1, 'relu']] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2


  - [-1, 2, Blocks, [64,  BasicBlock, 2, False]] # 4
  - [-1, 2, Blocks, [128, BasicBlock, 3, False]] # 5-P3
  - [-1, 2, Blocks, [256, BasicBlock, 4, False]] # 6-P4
  - [-1, 2, Blocks, [512, BasicBlock, 5, False]] # 7-P5

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]     # 9
  - [-1, 1, Conv, [256, 1, 1]]   # 10, Y5, lateral_convs.0

  - [4, 1, MV2Block, [64, 2, 2]]     # 11
  - [6, 1, CARAFE, [256,3,2]]        # 12
  - [[11, 5, 12], 1, Concat, [1]]    # 13
  - [-1, 1, Conv, [64, 1, 1]]        # 14
  - [-1, 1, iRMB, [64]]              # 15

  - [5, 1, MV2Block, [128, 2, 2]]    # 16
  - [10, 1, CARAFE, [256,3,2]]       # 17
  - [[16, 6, 17], 1, Concat, [1]]    # 18
  - [-1, 1, Conv, [128, 1, 1]]       # 19
  - [-1, 1, iRMB, [128]]             # 20

  - [[15, 20], 1, ASFF2, [64, 0]]    # 21
  - [[15, 20], 1, ASFF2, [128, 1]]   # 22
  - [-2, 1, RepC3_MSBlock, [64, 0.5]]     # 23
  - [-2, 1, RepC3_MSBlock, [128, 0.5]]    # 24

  - [[23, 24, 10], 1, ASFF3, [64, 0]]   # 25
  - [[23, 24, 10], 1, ASFF3, [128, 1]]  # 26
  - [[23, 24, 10], 1, ASFF3, [256, 2]]  # 27

  - [-3, 1, RepC3_MSBlock, [128, 0.5]]      # 28
  - [-3, 1, RepC3_MSBlock, [256, 0.5]]      # 29
  - [-3, 1, RepC3_MSBlock, [512, 0.5]]      # 30

  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)